alunmorris/ESP32-AI-chatbot-terminals/src/main.cpp
void drawInputBar() {
    int barY = kbVisible ? IBAR_Y_KB_SHOW : IBAR_Y_KB_HIDE;
    int barH = kbVisible ? IBAR_H_KB_SHOW : IBAR_H_KB_HIDE;

    tft.fillRect(0, barY, SCREEN_W, barH, COL_IBAR_BG);

    // Prompt marker — red when WiFi health check fails
    tft.setTextColor(wifiHealthy ? COL_IBAR_TEXT : TFT_RED, COL_IBAR_BG);
    tft.setTextSize(1);
    tft.setCursor(2, barY + (barH - 8) / 2);
    tft.print("> ");
    tft.setTextColor(COL_IBAR_TEXT, COL_IBAR_BG);  // restore white for input text

    // Input text (truncate if too long to fit)
    int maxChars = (SCREEN_W - BTN_SEND_W - 14) / 6;  // leave room for Send button
    char display[54] = {0};
    int start = (inputLen > maxChars) ? inputLen - maxChars : 0;
    strncpy(display, inputBuf + start, maxChars);
    tft.print(display);

    // Send / More button — text red when WiFi unhealthy
    tft.fillRect(SCREEN_W - BTN_SEND_W, barY + BTN_INSET, BTN_SEND_W - BTN_INSET*2, barH - BTN_INSET*2, COL_BTN_BG);
    tft.setTextColor(wifiHealthy ? COL_BTN_TEXT : TFT_RED, COL_BTN_BG);
    tft.setCursor(SCREEN_W - BTN_SEND_X_TEXT, barY + (barH - 8) / 2);
    tft.print(moreMode ? "More" : "Send");

    // Show KB button (only when KB hidden)
    if (!kbVisible) {
        tft.fillRect(SCREEN_W - BTN_SHOWKB_X, barY + BTN_INSET, BTN_SHOWKB_W, barH - BTN_INSET*2, COL_BTN_BG);
        tft.setTextColor(COL_BTN_TEXT, COL_BTN_BG);
        tft.setCursor(SCREEN_W - BTN_SHOWKB_X + 3, barY + (barH - 8) / 2);
        tft.print("Show KB");
    }
}

// --- Conversation history ---
struct Message {
    bool   isUser;
    bool   isError;
    char   text[2048];
};

static const int  MAX_MESSAGES = 20;
Message           history[MAX_MESSAGES];
int               historyCount = 0;

// Rendered line cache
static const int  MAX_LINES  = 400;
char              lines[MAX_LINES][54];   // 53 chars + null per line
uint16_t          lineColor[MAX_LINES];
int               lineCount    = 0;
int               scrollOffset = 0;       // lines scrolled up from bottom

void rebuildLines() {
    lineCount = 0;
    for (int m = 0; m < historyCount && lineCount < MAX_LINES - 2; m++) {
        uint16_t col = history[m].isError ? COL_ERROR :
                       history[m].isUser  ? COL_USER  : COL_AI;
        const char* prefix = history[m].isUser ? "You: " : "AI:  ";
        char full[2060];
        snprintf(full, sizeof(full), "%s%s", prefix, history[m].text);
        // Strip control chars and high bytes (text already sanitised in addMessage,
        // but prefix chars from prefix string are always clean ASCII).
        for (int j = 0; full[j]; j++) {
            unsigned char fc = (unsigned char)full[j];
            if ((fc < 32 && full[j] != '\n') || fc > 126) full[j] = ' ';
        }

        if (largeFont) {
            // Pixel-width word wrap for DejaVuSansBold12px
            tft.setFreeFont(&DejaVuSansBold12px);
            char lineBuf[54] = "";
            const char* p = full;
            while (*p && lineCount < MAX_LINES - 1) {
                if (*p == '\n') {
                    // Only flush if there's content — skip blank lines to
                    // avoid wasting the small number of visible large-font slots
                    if (lineBuf[0]) {
                        strncpy(lines[lineCount], lineBuf, 53);
                        lines[lineCount][53] = '\0';
                        lineColor[lineCount++] = col;
                        lineBuf[0] = '\0';
                    }
                    p++;
                    continue;
                }
                // Extract next word
                const char* ws = p;
                while (*p && *p != ' ' && *p != '\n') p++;
                int wlen = p - ws;
                if (wlen <= 0) { if (*p) p++; continue; }
                char word[54];
                strncpy(word, ws, min(wlen, 53));
                word[min(wlen, 53)] = '\0';
                if (*p == ' ') p++;
                // Test word on current line
                char test[108];   // lineBuf(53) + space(1) + word(53) + null
                if (lineBuf[0]) snprintf(test, 108, "%s %s", lineBuf, word);
                else            { strncpy(test, word, 53); test[53] = '\0'; }
                if (tft.textWidth(test) <= SCREEN_W - 2) {
                    strncpy(lineBuf, test, 53); lineBuf[53] = '\0';
                } else {
                    if (lineBuf[0]) {
                        strncpy(lines[lineCount], lineBuf, 53);
                        lines[lineCount][53] = '\0';
                        lineColor[lineCount++] = col;
                        strncpy(lineBuf, word, 53); lineBuf[53] = '\0';
                    } else {
                        strncpy(lines[lineCount], word, 53);
                        lines[lineCount][53] = '\0';
                        lineColor[lineCount++] = col;
                    }
                }
            }
            if (lineBuf[0] && lineCount < MAX_LINES) {
                strncpy(lines[lineCount], lineBuf, 53);
                lines[lineCount][53] = '\0';
                lineColor[lineCount++] = col;
            }
            tft.setTextFont(1);
        } else {
            int len = strlen(full);
            int pos = 0;
            while (pos < len && lineCount < MAX_LINES - 1) {
                // Look for \n within the next 54 chars (forced break wins over word-wrap)
                int nlPos = -1;
                for (int j = pos; j < pos + 54 && j < len; j++) {
                    if (full[j] == '\n') { nlPos = j; break; }
                }
                if (nlPos >= 0) {
                    int count = nlPos - pos;
                    strncpy(lines[lineCount], full + pos, count);
                    lines[lineCount][count] = '\0';
                    lineColor[lineCount++] = col;
                    pos = nlPos + 1;
                } else {
                    int remaining = len - pos;
                    if (remaining <= 53) {
                        strncpy(lines[lineCount], full + pos, remaining);
                        lines[lineCount][remaining] = '\0';
                        pos = len;
                    } else {
                        int cut = pos + 53;
                        while (cut > pos && full[cut] != ' ') cut--;
                        if (cut == pos) cut = pos + 53;
                        int count = cut - pos;
                        strncpy(lines[lineCount], full + pos, count);
                        lines[lineCount][count] = '\0';
                        pos = cut + (full[cut] == ' ' ? 1 : 0);
                    }
                    lineColor[lineCount++] = col;
                }
            }
        }
    }
}

void drawHistory() {
    int histH = kbVisible ? HIST_H_KB_SHOW : HIST_H_KB_HIDE;
    uint16_t bg = invertDisplay ? COL_INVERT_BG : COL_BG;
    tft.fillRect(0, 0, SCREEN_W, histH, bg);

    int lineH  = largeFont ? LINE_H_LARGE : LINE_H_SMALL;   // DejaVuSansBold12px: 15px  GLCD: 8px+2gap
    int maxVis = histH / lineH;

    // scrollOffset=0 means show bottom of history
    int firstIdx = lineCount - maxVis - scrollOffset;
    if (firstIdx < 0) firstIdx = 0;

