alunmorris/ESP32-AI-chatbot-terminals/src/main.cpp
void sendPrompt();  // forward declaration — defined after callGemini()

void handleTouch() {
    if (!ts.touched()) return;
    if (millis() - lastTouchMs < TOUCH_DEBOUNCE_MS) {
        while (ts.touched()) delay(10);
        return;
    }

    // Sample start position; track through release to get end position for swipe
    TS_Point startPt = ts.getPoint();
    TS_Point endPt   = startPt;
    while (ts.touched()) {
        endPt = ts.getPoint();
        delay(5);
    }
    lastTouchMs = millis();

    int sx, sy;
    mapTouch(startPt, sx, sy);
    if (sx < 0 || sy < 0 || sx >= SCREEN_W || sy >= SCREEN_H) return;

    // --- History area: swipe up/down to scroll ---
    int histH = kbVisible ? HIST_H_KB_SHOW : HIST_H_KB_HIDE;
    if (sy < histH) {
        int ex, ey;
        mapTouch(endPt, ex, ey);
        int deltaY = ey - sy;
        if (abs(deltaY) >= SWIPE_THRESHOLD) {
            int steps     = max(1, abs(deltaY) / 10);
            int lineH     = largeFont ? LINE_H_LARGE : LINE_H_SMALL;
            int maxVis    = histH / lineH;
            int maxScroll = max(0, lineCount - maxVis);
            if (deltaY > 0) {   // swipe down → older
                scrollOffset = min(scrollOffset + steps, maxScroll);
            } else {            // swipe up → newer
                scrollOffset = max(0, scrollOffset - steps);
            }
            drawHistory();
        }
        return;
    }

    int barY = kbVisible ? IBAR_Y_KB_SHOW : IBAR_Y_KB_HIDE;
    int barH = kbVisible ? IBAR_H_KB_SHOW : IBAR_H_KB_HIDE;

    // --- Send / More button ---
    if (inRect(sx, sy, SCREEN_W - BTN_SEND_W, barY + BTN_INSET, BTN_SEND_W - BTN_INSET*2, barH - BTN_INSET*2)) {
        sendPrompt();
        return;
    }

    // --- Show KB button (only when hidden) ---
    if (!kbVisible && inRect(sx, sy, SCREEN_W - BTN_SHOWKB_X, barY + BTN_INSET, BTN_SHOWKB_W, barH - BTN_INSET*2)) {
        kbVisible = true;
        tft.fillRect(0, 0, SCREEN_W, SCREEN_H, COL_BG);
        drawHistory();
        drawInputBar();
        drawKeyboard();
        return;
    }

    // --- Keyboard area ---
    if (kbVisible && sy >= KB_Y) {
        int rowStep = KEY_H + KEY_GAP;
        int row4Y   = KB_Y + 4 * rowStep + 1;

        // Row 4 special keys
        if (sy >= row4Y && sy < row4Y + KEY_H - 1) {
            if (inRect(sx, sy, SHIFT_X, row4Y, SHIFT_W, KEY_H - 1)) {
                shiftOn = !shiftOn;
                if (shiftOn) altOn = false;
                drawKeyboard();
            } else if (inRect(sx, sy, ALT_X, row4Y, ALT_W, KEY_H - 1)) {
                altOn = !altOn;
                if (altOn) shiftOn = false;
                drawKeyboard();
            } else if (inRect(sx, sy, SPACE_X, row4Y, SPACE_W, KEY_H - 1)) {
                drawKey(SPACE_X, row4Y, SPACE_W, KEY_H - 1, "SPACE", TFT_WHITE, COL_BG);
                delay(KEY_FLASH_MS);
                drawKey(SPACE_X, row4Y, SPACE_W, KEY_H - 1, "SPACE", COL_BTN_BG, COL_BTN_TEXT);
                if (inputLen < INPUT_MAX_LEN) { moreMode = false; inputBuf[inputLen++] = ' '; inputBuf[inputLen] = '\0'; drawInputBar(); }
            } else if (inRect(sx, sy, HIDE_X, row4Y, HIDE_W, KEY_H - 1)) {
                kbVisible = false;
                tft.fillRect(0, 0, SCREEN_W, SCREEN_H, COL_BG);
                drawHistory();
                drawInputBar();
            } else if (inRect(sx, sy, BS_X, row4Y, BS_W, KEY_H - 1)) {
                drawKey(BS_X, row4Y, BS_W, KEY_H - 1, "<-", TFT_WHITE, COL_BTN_TEXT);
                delay(KEY_FLASH_MS);
                drawKey(BS_X, row4Y, BS_W, KEY_H - 1, "<-", COL_BTN_BG, COL_BTN_TEXT);
                if (inputLen > 0) {
                    inputBuf[--inputLen] = '\0';
                    if (inputLen == 0 && historyCount > 0) moreMode = true;
                    drawInputBar();
                }
            }
            return;
        }

        // Character keys (rows 0–3): numbers, letters, ,./  (shifted: <>?  alt: []\)
        String typed = typeKBKey(sx, sy);
        if (typed.length() > 0) {
            int addLen = typed.length();
            if (inputLen + addLen <= INPUT_MAX_LEN) {
                moreMode = false;
                memcpy(inputBuf + inputLen, typed.c_str(), addLen);
                inputLen += addLen;
                inputBuf[inputLen] = '\0';
                drawInputBar();
            }
        }
        return;
    }

}

// --- RGB LED ---
void setRGBLed(uint8_t r, uint8_t g, uint8_t b) {
    // Active LOW: invert each channel
    ledcWrite(LED_R_CH, 255 - r);
    ledcWrite(LED_G_CH, 255 - g);
    ledcWrite(LED_B_CH, 255 - b);
}

void setupRGBLed() {
    ledcSetup(LED_R_CH, LED_PWM_FREQ, LED_PWM_BITS);
    ledcSetup(LED_G_CH, LED_PWM_FREQ, LED_PWM_BITS);
    ledcSetup(LED_B_CH, LED_PWM_FREQ, LED_PWM_BITS);
    ledcAttachPin(LED_R_PIN, LED_R_CH);
    ledcAttachPin(LED_G_PIN, LED_G_CH);
    ledcAttachPin(LED_B_PIN, LED_B_CH);
    setRGBLed(0, 0, 0);  // off at start
}

// Set LED colour based on WiFi RSSI (called after every health check)
// Blue ≥-55  Cyan ≥-65  Green ≥-75  Orange=weak-but-connected  Red=lost
void updateLedWifi() {
    if (WiFi.status() != WL_CONNECTED) {
        setRGBLed(255, 0, 0);   // Red: WiFi lost
        return;
    }
    int rssi = WiFi.RSSI();
    if      (rssi >= RSSI_THRESH_BLUE)  setRGBLed(  0,   0, 255);  // Blue:   strongest
    else if (rssi >= RSSI_THRESH_CYAN)  setRGBLed(  0, 255, 255);  // Cyan:   good
    else if (rssi >= RSSI_THRESH_GREEN) setRGBLed(  0, 255,   0);  // Green:  fair
    else                  setRGBLed(255, 128,   0);  // Orange: weak
}

// --- WiFi ---
void connectWiFi(bool showSplash = false) {
    if (showSplash) {
        tft.setFreeFont(&DejaVuSansBold12px);
        tft.setTextColor(TFT_YELLOW, COL_BG);
        tft.drawString("CYD AI chatbot v: -0.1.", 0, 0);
        tft.drawString("It's cheap for a reason.", 0, LINE_H_LARGE);
        tft.setTextColor(TFT_BLUE, COL_BG);
        char wifiMsg[80];
        snprintf(wifiMsg, sizeof(wifiMsg), "Connecting: %.55s...", WIFI_SSID);
        tft.drawString(wifiMsg, 0, 2 * LINE_H_LARGE);
        tft.setTextFont(1);
    }

    WiFi.mode(WIFI_STA);
    WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
    int attempts = 0;
    while (WiFi.status() != WL_CONNECTED && attempts < WIFI_MAX_ATTEMPTS) {
        delay(WIFI_RETRY_DELAY_MS);
        attempts++;
    }
    if (showSplash) tft.fillRect(0, 0, SCREEN_W, SPLASH_H, COL_BG);
    if (WiFi.status() != WL_CONNECTED) {
        addMessage(false, true, "WiFi connect failed");
    }
    updateLedWifi();
}

