alunmorris/ESP32-AI-chatbot-terminals/src/main.cpp
    return "ERR: no text in response";
}

// --- Send flow ---
void showThinking() {
    int barY = kbVisible ? IBAR_Y_KB_SHOW : IBAR_Y_KB_HIDE;
    int barH = kbVisible ? IBAR_H_KB_SHOW : IBAR_H_KB_HIDE;
    tft.fillRect(0, barY, SCREEN_W - BTN_SEND_W, barH, COL_IBAR_BG);
    tft.setTextColor(TFT_DARKGREY, COL_IBAR_BG);
    tft.setTextSize(1);
    tft.setCursor(2, barY + (barH - 8) / 2);
    tft.print("Thinking...");
}

void sendPrompt() {
    char prompt[128];
    if (inputLen == 0) {
        if (!moreMode) return;  // nothing typed and no AI reply yet — ignore tap
        strncpy(prompt, "Tell me more.", 127);
    } else {
        strncpy(prompt, inputBuf, 127);
        inputBuf[0] = '\0';
        inputLen    = 0;
    }
    prompt[127] = '\0';
    moreMode = false;
    kbVisible = false;   // hide KB; drawHistory() covers the KB area

    // Show user message and thinking indicator
    addMessage(true, false, prompt);
    showThinking();

    // Call API
    String response = useGrok ? callGrok(prompt) : callGemini(prompt);

    if (response.startsWith("ERR:")) {
        addMessage(false, true, response.c_str());
    } else {
        addMessage(false, false, response.c_str());
    }

    moreMode = true;   // after every reply, offer "More"
    drawInputBar();
}

void showModelChoices() {
    tft.setTextSize(1);
    tft.setTextColor(TFT_WHITE, COL_BG);
    tft.setCursor(0, 30); tft.print("Hit 1 for Gemini 2.5 Flash");
    tft.setCursor(0, 40); tft.print("    2 for Gemini 3 Flash");
    tft.setCursor(0, 50); tft.print("    3 for Gemini 3 Pro");
    tft.setCursor(0, 60); tft.print("    4 for Grok 4.1 Fast Reasoning");
    int nextY = 70;
    if (!largeFont) {
        tft.setCursor(0, nextY); tft.print("    b for bigger font");
        nextY += 10;
    }
    if (!invertDisplay) {
        tft.setCursor(0, nextY); tft.print("    i  to invert colours");
    }
}

void selectModel() {
    static const char* modelIds[]    = {
        "gemini-2.5-flash",
        "gemini-3-flash-preview",
        "gemini-3.1-pro-preview"
    };
    static const bool  modelGlobal[] = { true, true, false };

    showModelChoices();

    while (true) {
        if (!ts.touched()) continue;
        TS_Point pt = ts.getPoint();
        while (ts.touched()) delay(5);
        int sx, sy;
        mapTouch(pt, sx, sy);

        // Hit-test keys 1, 2, 3 (Gemini models)
        int x = 0;
        for (int i = 0; i < 3; i++, x += KEY_W) {
            if (inRect(sx, sy, x, KB_Y, KEY_W, KEY_H)) {
                char lbl[2] = { char('1' + i), '\0' };
                drawKey(x, KB_Y, KEY_W, KEY_H, lbl, TFT_WHITE, COL_BG);
                delay(KEY_FLASH_MS);
                drawKey(x, KB_Y, KEY_W, KEY_H, lbl, COL_KEY_FACE, COL_KEY_LABEL);
                strncpy(GEMINI_MODEL, modelIds[i], 47);
                GEMINI_MODEL[47] = '\0';
                geminiUseGlobal  = modelGlobal[i];
                useGrok          = false;
                uint16_t bg = invertDisplay ? COL_INVERT_BG : COL_BG;
                tft.fillRect(0, 0, SCREEN_W, HIST_H_KB_SHOW, bg);
                if (largeFont) {
                    tft.setFreeFont(&DejaVuSansBold12px);
                    tft.setTextColor(TFT_GREEN, bg);
                    tft.drawString("CYD AI chatbot", 0, 0);
                    tft.drawString(GEMINI_MODEL, 0, LINE_H_LARGE);
                    tft.setTextColor(TFT_DARKGREY, bg);
                    tft.drawString("Ready.", 0, 2 * LINE_H_LARGE);
                    tft.setTextFont(1);
                } else {
                    tft.setTextSize(1);
                    tft.setTextColor(TFT_GREEN, bg);
                    tft.setCursor(0,  0); tft.print("CYD AI chatbot. Swipe down for older chat.");
                    tft.setCursor(0, 10); tft.print("Model: "); tft.print(GEMINI_MODEL);
                    tft.setTextColor(TFT_DARKGREY, bg);
                    tft.setCursor(0, 20); tft.print("Ready.");
                }
                return;
            }
        }

        // Key 4 — Grok 4.1 Fast
        int x4 = 3 * KEY_W;
        if (inRect(sx, sy, x4, KB_Y, KEY_W, KEY_H)) {
            drawKey(x4, KB_Y, KEY_W, KEY_H, "4", TFT_WHITE, COL_BG);
            delay(KEY_FLASH_MS);
            drawKey(x4, KB_Y, KEY_W, KEY_H, "4", COL_KEY_FACE, COL_KEY_LABEL);
            useGrok = true;
            uint16_t bg = invertDisplay ? COL_INVERT_BG : COL_BG;
            tft.fillRect(0, 0, SCREEN_W, HIST_H_KB_SHOW, bg);
            if (largeFont) {
                tft.setFreeFont(&DejaVuSansBold12px);
                tft.setTextColor(TFT_GREEN, bg);
                tft.drawString("CYD AI chatbot", 0, 0);
                tft.drawString("Grok 4.1 Fast", 0, LINE_H_LARGE);
                tft.setTextColor(TFT_DARKGREY, bg);
                tft.drawString("Ready.", 0, 2 * LINE_H_LARGE);
                tft.setTextFont(1);
            } else {
                tft.setTextSize(1);
                tft.setTextColor(TFT_GREEN, bg);
                tft.setCursor(0,  0); tft.print("CYD AI chatbot. Swipe down for older chat.");
                tft.setCursor(0, 10); tft.print("Model: Grok 4.1 Fast");
                tft.setTextColor(TFT_DARKGREY, bg);
                tft.setCursor(0, 20); tft.print("Ready.");
            }
            return;
        }

        // Key B (ZXCVBNM row, index 4) — toggle large text, re-show choices
        if (!largeFont) {
            int rowStep = KEY_H + KEY_GAP;
            int row3Y   = KB_Y + 3 * rowStep;
            int xb      = 4 * KEY_W;
            if (inRect(sx, sy, xb, row3Y, KEY_W, KEY_H)) {
                drawKey(xb, row3Y, KEY_W, KEY_H, "B", TFT_WHITE, COL_BG);
                delay(KEY_FLASH_MS);
                drawKey(xb, row3Y, KEY_W, KEY_H, "b", COL_KEY_FACE, COL_KEY_LABEL);
                largeFont = true;
                tft.fillRect(0, 0, SCREEN_W, HIST_H_KB_SHOW, COL_BG);
                tft.setFreeFont(&DejaVuSansBold12px);
                tft.setTextColor(TFT_DARKGREY, COL_BG);
                tft.drawString("CYD AI chatbot. Large text.", 0, 0);
                tft.drawString("Select AI model:", 0, LINE_H_LARGE);
                tft.setTextFont(1);
                showModelChoices();
            }
        }

        // Key I (QWERTY row, index 7) — toggle invert colours, re-show choices
        {
            int rowStep = KEY_H + KEY_GAP;
            int row1Y   = KB_Y + rowStep;
            int xi      = 7 * KEY_W;
            if (inRect(sx, sy, xi, row1Y, KEY_W, KEY_H)) {
                drawKey(xi, row1Y, KEY_W, KEY_H, "I", TFT_WHITE, COL_BG);
                delay(KEY_FLASH_MS);
                drawKey(xi, row1Y, KEY_W, KEY_H, "i", COL_KEY_FACE, COL_KEY_LABEL);
                invertDisplay = !invertDisplay;
                tft.fillRect(0, 0, SCREEN_W, HIST_H_KB_SHOW, COL_BG);
                if (largeFont) {
                    tft.setFreeFont(&DejaVuSansBold12px);
                    tft.setTextColor(TFT_DARKGREY, COL_BG);
                    tft.drawString("CYD AI chatbot. Large text.", 0, 0);
                    tft.drawString("Select AI model:", 0, LINE_H_LARGE);
                    tft.setTextFont(1);
                } else {
                    tft.setTextSize(1);
                    tft.setTextColor(TFT_DARKGREY, COL_BG);
                    tft.setCursor(0,  0); tft.print("CYD AI chatbot. Swipe down for older chat.");
                    tft.setCursor(0, 10); tft.print("Ready. Select AI model:");
                }
                showModelChoices();
            }
        }
    }
}

void setup() {
    Serial.begin(115200);
    waitMsgIdx = random(NUM_WAIT_MSGS);

    // Display (init before backlight to avoid white flash)
    tft.init();
    tft.setRotation(1);
    tft.fillScreen(COL_BG);

    // Backlight on after screen is ready
    pinMode(TFT_BL, OUTPUT);
    digitalWrite(TFT_BL, HIGH);

    // Touch
    touchSPI.begin(TOUCH_SCLK, TOUCH_MISO, TOUCH_MOSI, TOUCH_CS_PIN);
    ts.begin(touchSPI);
    ts.setRotation(1);

    // Drain spurious startup touch
    unsigned long t0 = millis();
    while (ts.touched() && millis() - t0 < 500) delay(10);

    setupRGBLed();

    drawKeyboard();
    drawInputBar();
    connectWiFi(true);

    // Startup help — drawn directly in history area; cleared on first chat message
    tft.setTextSize(1);
    tft.setTextColor(TFT_DARKGREY, COL_BG);
    tft.setCursor(0,  0); tft.print("CYD AI chatbot. Swipe down for older chat.");
    tft.setCursor(0, 10); tft.print("Ready. Select AI model:");

    selectModel();  // draws choices at y=30+ and waits for 1/2/3
}

void checkWiFiHealth() {
    updateLedWifi();  // instant — runs every loop, LED reacts immediately to dropout

    if (millis() - lastWiFiCheckMs < 3000) return;
    lastWiFiCheckMs = millis();

    bool ok = (WiFi.status() == WL_CONNECTED) && Ping.ping(IPAddress(8,8,8,8), 1);

    if (ok != wifiHealthy) {
        wifiHealthy = ok;
        drawInputBar();  // '>' and Send/More turn red on fail, white on recovery
    }

    if (!ok) {
        // Reconnect in background — status checked on next 10s tick
        WiFi.disconnect(false);
        WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
    }
}

void loop() {
    handleTouch();
    checkWiFiHealth();
}
